apimartifacts/apis/tempconvert/specification.wsdl

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="https://www.w3schools.com/xml/" targetNamespace="https://www.w3schools.com/xml/"><wsdl:types><s:schema elementFormDefault="qualified" targetNamespace="https://www.w3schools.com/xml/" xmlns:s="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:http="http://schemas.xmlsoap.org/wsdl/http/" xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/" xmlns:tns="https://www.w3schools.com/xml/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tm="http://microsoft.com/wsdl/mime/textMatching/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"><s:element name="FahrenheitToCelsius"><s:complexType><s:sequence><s:element minOccurs="0" maxOccurs="1" name="Fahrenheit" type="s:string" /></s:sequence></s:complexType></s:element><s:element name="FahrenheitToCelsiusResponse"><s:complexType><s:sequence><s:element minOccurs="0" maxOccurs="1" name="FahrenheitToCelsiusResult" type="s:string" /></s:sequence></s:complexType></s:element><s:element name="CelsiusToFahrenheit"><s:complexType><s:sequence><s:element minOccurs="0" maxOccurs="1" name="Celsius" type="s:string" /></s:sequence></s:complexType></s:element><s:element name="CelsiusToFahrenheitResponse"><s:complexType><s:sequence><s:element minOccurs="0" maxOccurs="1" name="CelsiusToFahrenheitResult" type="s:string" /></s:sequence></s:complexType></s:element><s:element name="string" nillable="true" type="s:string" /></s:schema></wsdl:types><wsdl:message name="FahrenheitToCelsius_InputMessage"><wsdl:part name="parameters" element="tns:FahrenheitToCelsius" /></wsdl:message><wsdl:message name="FahrenheitToCelsius_OutputMessage"><wsdl:part name="parameters" element="tns:FahrenheitToCelsiusResponse" /></wsdl:message><wsdl:message name="CelsiusToFahrenheit_InputMessage"><wsdl:part name="parameters" element="tns:CelsiusToFahrenheit" /></wsdl:message><wsdl:message name="CelsiusToFahrenheit_OutputMessage"><wsdl:part name="parameters" element="tns:CelsiusToFahrenheitResponse" /></wsdl:message><wsdl:portType name="TempConvert"><wsdl:operation name="FahrenheitToCelsius"><wsdl:input message="tns:FahrenheitToCelsius_InputMessage" /><wsdl:output message="tns:FahrenheitToCelsius_OutputMessage" /></wsdl:operation><wsdl:operation name="CelsiusToFahrenheit"><wsdl:input message="tns:CelsiusToFahrenheit_InputMessage" /><wsdl:output message="tns:CelsiusToFahrenheit_OutputMessage" /></wsdl:operation></wsdl:portType><wsdl:binding name="TempConvert" type="tns:TempConvert"><binding transport="http://schemas.xmlsoap.org/soap/http" xmlns="http://schemas.xmlsoap.org/wsdl/soap/" /><wsdl:operation name="FahrenheitToCelsius"><soap:operation soapAction="https://www.w3schools.com/xml/FahrenheitToCelsius" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" /><wsdl:input><soap:body use="literal" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" /></wsdl:input><wsdl:output><soap:body use="literal" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" /></wsdl:output></wsdl:operation><wsdl:operation name="CelsiusToFahrenheit"><soap:operation soapAction="https://www.w3schools.com/xml/CelsiusToFahrenheit" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" /><wsdl:input><soap:body use="literal" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" /></wsdl:input><wsdl:output><soap:body use="literal" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" /></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="TempConvert"><wsdl:port name="TempConvert" binding="tns:TempConvert"><address location="https://red-scus-apimdemo-dev.azure-api.net/tempconvert" xmlns="http://schemas.xmlsoap.org/wsdl/soap/" /></wsdl:port></wsdl:service></wsdl:definitions>