TestServicesSoap/src/test/resources/soap/tofahrenheit.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="https://www.w3schools.com/xml/">
    <soapenv:Header/>
    <soapenv:Body>
        <ns:CelsiusToFahrenheit>
            <!--Optional:-->
            <ns:Celsius>%s</ns:Celsius>
        </ns:CelsiusToFahrenheit>
    </soapenv:Body>
</soapenv:Envelope>